app/controllers/agendas_controller.rb

SELECT * FROM `agendas` WHERE (`agendas`.user_id = 1)
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
---
  def index
    if params[:search]
      @agendas = AgendaItem.search(params[:search]).collect {|x| x.agenda if x.agenda.user == current_user}.compact

SELECT * FROM `agendas` WHERE (`agendas`.`id` = 1)
---
  def show
    @agenda = Agenda.find(params[:id])

INSERT INTO "agendas" ("end_time", "created_at", "updated_at", "date", "activity_name", "oic", "start_time") VALUES('2009-08-18 16:40:00', '2009-08-13 01:03:28', '2009-08-13 01:03:28', '2009-08-13', 'Opening', 'SQ/CC', '2009-08-18 06:30:00')
---
  def create
    @agenda = current_user.agendas.new(params[:agenda])
    if @agenda.save

SELECT * FROM `agendas` WHERE (`agendas`.`id` = 1)
---
  def edit
    @agenda = Agenda.find(params[:id])

SELECT * FROM `agendas` WHERE (`agendas`.`id` = 1)
UPDATE `agendas` SET `date` = '2009-08-18', `updated_at` = '2009-08-14 01:14:32' WHERE `id` = 1
---
  def update
    @agenda = Agenda.find(params[:id])
    if @agenda.update_attributes(params[:agenda])