app/controllers/agenda_items_controller.rb

  def show
    @agenda_item = AgendaItem.find(params[:id])
---
SELECT * FROM "agenda_items" WHERE ("agenda_items"."id" = 1)

  def create

    # params[:agenda_item][:agenda] = @agenda  unless params[:agenda_item].blank?
    @agenda_item = @agenda.agenda_items.create(params[:agenda_item]) rescue AgendaItem.new(params[:agenda_item])
---
INSERT INTO `agenda_items` (`date`, `start_time`, `end_time`, `activity_name`, `oic`, `agenda_id`, `created_at`, `updated_at`) VALUES('2009-08-13', '2009-08-14 18:00:00', '2009-08-14 18:10:00', 'Opening', 'SQ/CC', 1, '2009-08-14 01:11:38', '2009-08-14 01:11:38')

  def edit
    @agenda_item = AgendaItem.find(params[:id])
---
SELECT * FROM "agenda_items" WHERE ("agenda_items"."id" = 27)

  def update
    @agenda_item = AgendaItem.find(params[:id])
    @agenda_item.agenda = Agenda.find(params[:agenda_id])
    @agenda_item.date = @agenda_item.agenda.date
    @agenda_item.activity_name = params[:agenda_item][:activity_name]
    @agenda_item.oic = params[:agenda_item][:oic]
    @agenda_item.start_time = (@agenda_item.date.to_s + " " + (Chronic.parse(  params[:agenda_item][:start_time])).strftime('%H:%M:%S')).to_time
    @agenda_item.end_time =   (@agenda_item.date.to_s + " " + (Chronic.parse( params[:agenda_item][:end_time])).strftime('%H:%M:%S')).to_time

    if @agenda_item.save
---
SELECT * FROM "agenda_items" WHERE ("agenda_items"."id" = 27)
SELECT * FROM "agendas" WHERE ("agendas"."id" = 1)
UPDATE "agenda_items" SET "updated_at" = '2009-08-13 05:18:51', "date" = '2009-08-18' WHERE "id" = 3

  def load_agenda
    @agenda = Agenda.find(params[:agenda_id])
---
SELECT * FROM `agendas` WHERE (`agendas`.`id` = 1)