app/controllers/users_controller.rb

INSERT INTO `users` (`username`, `email`, `crypted_password`, `password_salt`, `persistence_token`, `created_at`, `updated_at`) VALUES('akatz', 'iambpentameter@gmail.com', '01e4337093b50c5f12b43aac0d151bcd0536f84005267c56872781161dd667c93f69e1004ed97c38d4a482022d707771fb821f4f7e2ea1d193f538f3a8f6a0bf', 'rkw2LLX0-_pzyu08wnmB', 'a3b84d738bb6912da9ff4f9e94ed005e45947cd88650cf3a4d1e99d0892a1bbce38f341bbf1af0909274163976fe98437a0fad86129e54030a4d53760e8df6d6', '2009-08-14 23:46:25', '2009-08-14 23:46:25')
---
  def create
    @user = User.new(params[:user])
    if @user.save

UPDATE `users` SET `logo_file_name` = 'logo.png', `logo_content_type` = 'image/png', `logo_file_size` = 0, `logo_updated_at` = '2009-08-15 00:26:56', `updated_at` = '2009-08-15 00:26:56' WHERE `id` = 1
---
  def update
    @user = current_user
    if @user.update_attributes(params[:user])